simulator/src/main/resources/message/acs/GetParameterValues.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/"
                   xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:cwmp="urn:dslforum-org:cwmp-1-2">
    <soap-env:Header>
        <cwmp:ID soap-env:mustUnderstand="1">18012e76ef20013</cwmp:ID>
    </soap-env:Header>
    <soap-env:Body>
        <cwmp:GetParameterValues>
            <ParameterNames soap-enc:arrayType="xsd:string[18]">
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.1.HostName</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.1.IPAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.1.MACAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.2.HostName</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.2.IPAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.2.MACAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.3.HostName</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.3.IPAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.3.MACAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.4.HostName</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.4.IPAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.4.MACAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.5.HostName</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.5.IPAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.5.MACAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.6.HostName</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.6.IPAddress</string>
                <string>InternetGatewayDevice.LANDevice.1.Hosts.Host.6.MACAddress</string>
            </ParameterNames>
        </cwmp:GetParameterValues>
    </soap-env:Body>
</soap-env:Envelope>